# ============================================================================
# Brewfile - Homebrew Package Management
# ============================================================================
# Usage:
#   brew bundle install  - Install all packages from this file
#   brew bundle check    - Check if all packages are installed
#   brew bundle cleanup  - Uninstall packages not listed in this file
#   brew bundle dump     - Generate Brewfile from current installations
# ============================================================================

# ============================================================================
# Taps
# ============================================================================
tap "dopplerhq/cli"      # Doppler secrets management

# ============================================================================
# CLI Tools & Utilities
# ============================================================================

# Package Management
brew "mas"              # Mac App Store CLI

# Development Tools
brew "nixpacks"         # Build and deploy apps
brew "act"              # Run GitHub Actions locally
brew "ansible"          # Infrastructure automation
brew "incus"            # CLI client for Incus containers
brew "gh"               # GitHub CLI
brew "ripgrep"          # Fast search (rg command)
brew "tree"             # Directory tree view
brew "direnv"           # Per-directory environment variables

# Secrets Management
brew "gnupg"            # GPG encryption (required for Doppler)
brew "doppler"          # Secrets management CLI

# AI/ML CLIs
cask "codex"            # OpenAI Codex CLI
brew "gemini-cli"       # Google Gemini CLI
brew "opencode"         # AI coding agent

# System Utilities
brew "wget"             # Network downloader
brew "asimov"           # Prevent Time Machine backups of dev folders
brew "displayplacer"    # Display scaling utility
brew "dockutil"         # Manage macOS Dock items from command line

# ============================================================================
# Applications - Communication
# ============================================================================
cask "discord"
cask "slack"
cask "whatsapp"
cask "telegram"

# ============================================================================
# Applications - Development
# ============================================================================
cask "zed@preview"      # Code editor
cask "github"           # GitHub Desktop
cask "tableplus"        # Database management
cask "claude-code"      # Claude Code CLI
cask "figma"            # Design and prototyping tool
cask "docker"           # Container runtime

# ============================================================================
# Applications - Browsers & Network
# ============================================================================
cask "google-chrome"       # Web browser
cask "wifiman"             # WiFi analyzer

# ============================================================================
# Applications - Security & VPN
# ============================================================================
cask "1password"
cask "1password-cli"
cask "tailscale"        # Mesh VPN
cask "mullvadvpn"       # Privacy VPN

# ============================================================================
# Applications - Productivity & Utilities
# ============================================================================
cask "notion"           # Notes and workspace
cask "libreoffice"      # Office suite
cask "rectangle"        # Window management
cask "keepingyouawake"  # Prevent sleep
cask "cleanshot"        # Screenshot tool
cask "topnotch"         # Notch customization
cask "balenaetcher"     # USB/SD card imaging
cask "macs-fan-control" # Fan control utility
